Конфигурация/Catalogs/ПакетыДанныхКОбработке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПакетыДанныхКОбработке</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПакетовДанныхКОбработке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделенНаТома</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаменятьФайлыВКаталоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВажностиЭлектронногоПисьма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбрабатыватьТексты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОДоставке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторыОснований</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаОтменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменившийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПривязанКТексту</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тома</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСлепыхКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленияОДоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленияОПрочтении</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбратныеАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ПакетыДанныхКОбработке/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбработкаОтменена Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОтмены");
		ПроверяемыеРеквизиты.Добавить("ОтменившийПользователь");
	Иначе
		
		Если ЗначениеЗаполнено(ДатаОтмены) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Дата отмены' заполняется только для пакетов данных, обработка которых отменена!", ЭтотОбъект, "ДатаОтмены",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтменившийПользователь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Отменивший пользователь' заполняется только для пакетов данных, обработка которых отменена!", ЭтотОбъект, "ОтменившийПользователь",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Вид = Перечисления.ВидыПакетовДанныхКОбработке.ВыгрузкаФайла Тогда
		
		ПроверяемыеРеквизиты.Добавить("Путь");
		
		Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Учетная запись' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "УчетнаяЗапись",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресОтправителя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Адрес отправителя' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "АдресОтправителя",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяОтправителя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Имя отправителя' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ИмяОтправителя",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Тема) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Тема' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Тема",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Текст) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Текст' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Текст",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипТекста) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Тип текста' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ТипТекста",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Важность) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Важность' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Важность",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Кодировка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Кодировка' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Кодировка",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбрабатыватьТексты) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Обрабатывать тексты' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ОбрабатыватьТексты",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(УведомитьОДоставке) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Уведомить о доставке' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "УведомитьОДоставке",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(УведомитьОПрочтении) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Уведомить о прочтении' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "УведомитьОПрочтении",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИдентификаторыОснований) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Идентификаторы оснований' заполняется только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ИдентификаторыОснований",, Отказ);
		КонецЕсли;
		
		Если Получатели.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "Получатели",, Отказ);
		КонецЕсли;
		
		Если ПолучателиКопий.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели копий' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиКопий",, Отказ);
		КонецЕсли;
		
		Если ПолучателиСлепыхКопий.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели слепых копий' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиСлепыхКопий",, Отказ);
		КонецЕсли;
		
		Если ПолучателиУведомленияОДоставке.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели уведомлений о доставке' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиУведомленияОДоставке",, Отказ);
		КонецЕсли;
		
		Если ПолучателиУведомленияОПрочтении.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Получатели уведомлений о прочтении' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ПолучателиУведомленияОПрочтении",, Отказ);
		КонецЕсли;
		
		Если ОбратныеАдреса.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Обратные адреса' заполняются только для пакетов данных с видом 'Электронное письмо', обработка которых отменена!", ЭтотОбъект, "ОбратныеАдреса",, Отказ);
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Путь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Путь' заполняется только для пакетов данных с видом 'Выгрузка файла', обработка которых отменена!", ЭтотОбъект, "Путь",, Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НеЗаменятьФайлыВКаталоге) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Не заменять файлы в каталоге' заполняется только для пакетов данных с видом 'Выгрузка файла', обработка которых отменена!", ЭтотОбъект, "НеЗаменятьФайлыВКаталоге",, Отказ);
		КонецЕсли;
		
		ПроверяемыеРеквизиты.Добавить("АдресОтправителя");
		ПроверяемыеРеквизиты.Добавить("Получатели");
		
		Если УведомитьОДоставке Тогда
			ПроверяемыеРеквизиты.Добавить("ПолучателиУведомленияОДоставке");
		КонецЕсли;
		
		Если УведомитьОПрочтении Тогда
			ПроверяемыеРеквизиты.Добавить("ПолучателиУведомленияОПрочтении");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый()
		И ЭтотОбъект.ПометкаУдаления
		И НЕ ЭтотОбъект.Ссылка.ПометкаУдаления
		И НЕ ЭтотОбъект.Ссылка.ОбработкаОтменена Тогда
		
		Если НЕ ЭтотОбъект.ОбработкаОтменена Тогда
			ЭтотОбъект.ОбработкаОтменена = Истина;
		КонецЕсли;
		
		РаботаСОтчетами.ЗафиксироватьОтменуОтправкиИлиВыгрузкиОтчета(ЭтотОбъект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
